TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G5187/driverlib/spi_peripheral_multibyte_fifo_poll/spi_peripheral_multibyte_fifo_poll.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
//@cliArgs --device "MSPM0G518X" --package "LQFP-64(PM)" --part "Default"
//@v2CliArgs --device "MSPM0G5187" --package "LQFP-64(PM)"
// @cliArgs --board /ti/boards/LP_MSPM0G5187 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const GPIO  = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1 = GPIO.addInstance();
const SPI   = scripting.addModule("/ti/driverlib/SPI", {}, false);
const SPI1  = SPI.addInstance();
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");

/**
 * Write custom configuration values to the imported modules.
 */
GPIO1.$name                                 = "GPIO_LEDS";
GPIO1.port                                  = "PORTA";
GPIO1.associatedPins.create(2);
GPIO1.associatedPins[0].$name               = "USER_LED_1";
GPIO1.associatedPins[0].assignedPin         = "17";
GPIO1.associatedPins[0].initialValue        = "SET";
GPIO1.associatedPins[1].$name               = "USER_TEST";
GPIO1.associatedPins[1].assignedPin         = "21";
GPIO1.associatedPins[1].initialValue        = "SET";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

SPI1.$name                      = "SPI_0";
SPI1.mode                       = "PERIPHERAL";
SPI1.peripheralChipSelect               = "1";
SPI1.peripheral.$assign         = "UC2";
SPI1.peripheral.sclkPin.$assign     = "PB18";
SPI1.peripheral.mosiPin.$assign     = "PB17";
SPI1.peripheral.misoPin.$assign     = "PB19";
SPI1.peripheral.cs1Pin.$assign  = "PB24";

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn  = true;
